open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsgfs_test.c
/****************************************************************************
 * chips/bk7258/common/
 * bk7258_rpmsgfs_test.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Bounded control plane for exercising the stock NuttX RPMsgFS client on
 * AP.  File operations run only in one disposable logical-CPU0 worker; no
 * VFS call or blocking send is made from an RPMsg endpoint callback.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_RPMSGFS_TEST

#include <dirent.h>
#include <errno.h>
#include <fcntl.h>
#include <malloc.h>
#include <pthread.h>
#include <sched.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <sys/stat.h>
#include <unistd.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_rptun.h>

#include "bk7258_rptun.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_RPMSGFS_TEST_EPT_NAME       "bk7258-rpmsgfs-test"
#define BK7258_RPMSGFS_TEST_WIRE_MAGIC     0x57465242u /* "BRFW" */
#define BK7258_RPMSGFS_TEST_WIRE_VERSION   1u
#define BK7258_RPMSGFS_TEST_SEND_TIMEOUT   500u
#define BK7258_RPMSGFS_TEST_CONNECT_MS     3000u
#define BK7258_RPMSGFS_TEST_MIN_TIMEOUT    1000u
#define BK7258_RPMSGFS_TEST_MAX_TIMEOUT    120000u

#ifdef CONFIG_BK7258_AP_CORE
#  define BK7258_RPMSGFS_TEST_REMOTE_NAME  "cp"
#  define BK7258_RPMSGFS_TEST_DIR          "/cpdata/rpmsgfs-n11"
#  define BK7258_RPMSGFS_TEST_FILE         \
     "/cpdata/rpmsgfs-n11/item.bin"
#  define BK7258_RPMSGFS_TEST_RENAMED      \
     "/cpdata/rpmsgfs-n11/renamed.bin"
#else
#  define BK7258_RPMSGFS_TEST_REMOTE_NAME  "ap"
#endif

enum bk7258_rpmsgfs_test_command_e
{
  BK7258_RPMSGFS_TEST_COMMAND_START = 1,
  BK7258_RPMSGFS_TEST_COMMAND_REPORT
};

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_rpmsgfs_test_wire_s
{
  uint32_t magic;
  uint32_t version;
  uint32_t command;
  uint32_t generation;
  uint32_t sequence;
  uint32_t iterations;
  uint32_t payload_size;
  uint32_t timeout_ms;
  struct bk7258_rpmsgfs_test_result_s result;
};

struct bk7258_rpmsgfs_test_dev_s
{
  struct rpmsg_endpoint ept;
  bool initialized;
  bool endpoint_created;
  int connection_error;
#ifdef CONFIG_BK7258_AP_CORE
  sem_t start_sem;
  bool abort;
  bool busy;
  int request_status;
  uint32_t request_generation;
  uint32_t request_sequence;
  uint32_t request_iterations;
  uint32_t request_payload_size;
  uint32_t request_timeout_ms;
#else
  sem_t report_sem;
  bool report_valid;
  uint32_t waiting_generation;
  uint32_t waiting_sequence;
  struct bk7258_rpmsgfs_test_result_s report;
#endif
};

/****************************************************************************
 * Compile-time ABI Gates
 ****************************************************************************/

static_assert(offsetof(struct bk7258_rpmsgfs_test_wire_s, result) == 32u,
              "BK7258 RPMsgFS wire header changed");
static_assert(sizeof(struct bk7258_rpmsgfs_test_wire_s) <=
              BK7258_RPMSG_TEST_FRAME_SIZE,
              "BK7258 RPMsgFS report cannot fit one RPMsg frame");

#if defined(CONFIG_BK7258_AP_CORE) && \
    defined(CONFIG_BK7258_AP_SUPERVISOR)
static_assert(CONFIG_BK7258_RPMSGFS_TEST_PRIORITY <
              CONFIG_BK7258_AP_SUPERVISOR_PRIORITY,
              "RPMsgFS test worker must remain below AP heartbeat");
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct bk7258_rpmsgfs_test_dev_s g_bk7258_rpmsgfs_test;

#ifndef CONFIG_BK7258_AP_CORE
static mutex_t g_bk7258_rpmsgfs_test_lock = NXMUTEX_INITIALIZER;
static uint32_t g_bk7258_rpmsgfs_test_next_sequence;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static int bk7258_rpmsgfs_test_sem_init(sem_t *sem)
{
  int ret = nxsem_init(sem, 0, 0);

#ifdef CONFIG_PRIORITY_INHERITANCE
  if (ret >= 0)
    {
      ret = nxsem_set_protocol(sem, SEM_PRIO_NONE);
    }
#endif

  return ret;
}

static void bk7258_rpmsgfs_test_flush_sem(sem_t *sem)
{
  while (nxsem_trywait(sem) == OK)
    {
    }
}

static bool bk7258_rpmsgfs_test_generation_ready(uint32_t generation)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  __asm volatile ("dmb sy" ::: "memory");
  return generation != 0 &&
         control->magic == BK7258_RPTUN_CONTROL_MAGIC &&
         control->version == BK7258_RPTUN_CONTROL_VERSION &&
         control->size == sizeof(*control) &&
         control->generation == generation &&
         control->state == BK7258_RPTUN_STATE_CONNECTED;
}

static bool bk7258_rpmsgfs_test_endpoint_ready(void)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = &g_bk7258_rpmsgfs_test;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  return __atomic_load_n(&priv->endpoint_created, __ATOMIC_ACQUIRE) &&
         bk7258_rpmsgfs_test_generation_ready(control->generation) &&
         is_rpmsg_ept_ready(&priv->ept);
}

static bool bk7258_rpmsgfs_test_deadline_expired(clock_t started,
                                                  uint32_t timeout_ms)
{
  clock_t elapsed = clock_systime_ticks() - started;

  return elapsed >= MSEC2TICK(timeout_ms);
}

static int bk7258_rpmsgfs_test_send_bounded(const void *data, size_t len,
                                             uint32_t generation,
                                             uint32_t timeout_ms)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = &g_bk7258_rpmsgfs_test;
  clock_t started = clock_systime_ticks();
  int ret = -ENOTCONN;

