open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsgfs_test.c
  for (; ; )
    {
      if (!bk7258_rpmsgfs_test_endpoint_ready() ||
          !bk7258_rpmsgfs_test_generation_ready(generation))
        {
          return -ENOTCONN;
        }

      ret = rpmsg_trysend(&priv->ept, data, len);
      if (ret >= 0)
        {
          return OK;
        }

      if (bk7258_rpmsgfs_test_deadline_expired(started, timeout_ms))
        {
          break;
        }

      nxsig_usleep(1000);
    }

  return ret < 0 ? ret : -ETIMEDOUT;
}

#ifdef CONFIG_BK7258_AP_CORE

static int bk7258_rpmsgfs_test_neg_errno(void)
{
  int error = get_errno();
  return error > 0 ? -error : -EIO;
}

static void bk7258_rpmsgfs_test_heap(uint32_t *used, uint32_t *free_bytes,
                                     uint32_t *largest)
{
  struct mallinfo info = mallinfo();

  *used = info.uordblks;
  *free_bytes = info.fordblks;
  *largest = info.mxordblk;
}

static uint32_t bk7258_rpmsgfs_test_checksum(const uint8_t *data,
                                              uint32_t length)
{
  uint32_t hash = 2166136261u;
  uint32_t i;

  for (i = 0; i < length; i++)
    {
      hash ^= data[i];
      hash *= 16777619u;
    }

  return hash;
}

static void bk7258_rpmsgfs_test_cleanup(void)
{
  (void)unlink(BK7258_RPMSGFS_TEST_RENAMED);
  (void)unlink(BK7258_RPMSGFS_TEST_FILE);
  (void)rmdir(BK7258_RPMSGFS_TEST_DIR);
}

static int bk7258_rpmsgfs_test_files(
  struct bk7258_rpmsgfs_test_result_s *result)
{
  uint8_t tx[BK7258_RPMSGFS_TEST_MAX_PAYLOAD];
  uint8_t rx[BK7258_RPMSGFS_TEST_MAX_PAYLOAD];
  struct stat st;
  struct dirent *entry;
  DIR *dir = NULL;
  uint32_t iteration;
  uint32_t offset;
  uint32_t checksum;
  bool found;
  ssize_t transferred;
  int fd = -1;
  int ret = OK;

  result->step = BK7258_RPMSGFS_TEST_STEP_CLEANUP;
  bk7258_rpmsgfs_test_cleanup();

  result->step = BK7258_RPMSGFS_TEST_STEP_MKDIR;
  if (mkdir(BK7258_RPMSGFS_TEST_DIR, 0777) < 0 &&
      get_errno() != EEXIST)
    {
      return bk7258_rpmsgfs_test_neg_errno();
    }

  for (iteration = 0; iteration < result->iterations_requested; iteration++)
    {
      if (!bk7258_rpmsgfs_test_generation_ready(result->generation) ||
          __atomic_load_n(&g_bk7258_rpmsgfs_test.abort,
                          __ATOMIC_ACQUIRE))
        {
          result->step = BK7258_RPMSGFS_TEST_STEP_GENERATION;
          ret = -ENOTCONN;
          goto out;
        }

      for (offset = 0; offset < result->payload_size; offset++)
        {
          tx[offset] = (uint8_t)(result->sequence + iteration * 33u +
                                 offset);
        }

      memset(rx, 0, result->payload_size);
      checksum = bk7258_rpmsgfs_test_checksum(tx, result->payload_size);

      result->step = BK7258_RPMSGFS_TEST_STEP_OPEN_WRITE;
      fd = open(BK7258_RPMSGFS_TEST_FILE,
                O_WRONLY | O_CREAT | O_TRUNC, 0666);
      if (fd < 0)
        {
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      result->step = BK7258_RPMSGFS_TEST_STEP_WRITE;
      offset = 0;
      while (offset < result->payload_size)
        {
          transferred = write(fd, &tx[offset],
                              result->payload_size - offset);
          if (transferred <= 0)
            {
              ret = transferred < 0 ? bk7258_rpmsgfs_test_neg_errno() :
                                      -EIO;
              goto out;
            }

          offset += (uint32_t)transferred;
          result->bytes_written += (uint32_t)transferred;
        }

      result->step = BK7258_RPMSGFS_TEST_STEP_SYNC;
      if (fsync(fd) < 0)
        {
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      if (close(fd) < 0)
        {
          fd = -1;
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      fd = -1;
      result->step = BK7258_RPMSGFS_TEST_STEP_STAT;
      if (stat(BK7258_RPMSGFS_TEST_FILE, &st) < 0)
        {
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      if (st.st_size != (off_t)result->payload_size)
        {
          ret = -EFBIG;
          goto out;
        }

      result->step = BK7258_RPMSGFS_TEST_STEP_OPEN_READ;
      fd = open(BK7258_RPMSGFS_TEST_FILE, O_RDONLY);
      if (fd < 0)
        {
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      result->step = BK7258_RPMSGFS_TEST_STEP_SEEK;
      if (lseek(fd, 0, SEEK_SET) != 0)
        {
          ret = -EIO;
          goto out;
        }

      result->step = BK7258_RPMSGFS_TEST_STEP_READ;
      offset = 0;
      while (offset < result->payload_size)
        {
          transferred = read(fd, &rx[offset],
                             result->payload_size - offset);
          if (transferred <= 0)
            {
              ret = transferred < 0 ? bk7258_rpmsgfs_test_neg_errno() :
                                      -EIO;
              goto out;
            }

          offset += (uint32_t)transferred;
          result->bytes_read += (uint32_t)transferred;
        }

      if (close(fd) < 0)
        {
          fd = -1;
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      fd = -1;
      result->expected_checksum ^= checksum + iteration;
      result->actual_checksum ^=
        bk7258_rpmsgfs_test_checksum(rx, result->payload_size) + iteration;
      result->step = BK7258_RPMSGFS_TEST_STEP_VERIFY;
      if (memcmp(tx, rx, result->payload_size) != 0 ||
          result->actual_checksum != result->expected_checksum)
        {
          ret = -EBADMSG;
          goto out;
        }

      result->step = BK7258_RPMSGFS_TEST_STEP_RENAME;
      if (rename(BK7258_RPMSGFS_TEST_FILE,
                 BK7258_RPMSGFS_TEST_RENAMED) < 0)
        {
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      result->step = BK7258_RPMSGFS_TEST_STEP_OPENDIR;
      dir = opendir(BK7258_RPMSGFS_TEST_DIR);
      if (dir == NULL)
        {
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      found = false;
      result->step = BK7258_RPMSGFS_TEST_STEP_READDIR;
      while ((entry = readdir(dir)) != NULL)
        {
          result->dir_entries++;
          if (strcmp(entry->d_name, "renamed.bin") == 0)
            {
              found = true;
            }
        }

      if (closedir(dir) < 0)
        {
          dir = NULL;
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

