open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsgfs_test.c
      dir = NULL;
      if (!found)
        {
          ret = -ENOENT;
          goto out;
        }

      result->step = BK7258_RPMSGFS_TEST_STEP_UNLINK;
      if (unlink(BK7258_RPMSGFS_TEST_RENAMED) < 0)
        {
          ret = bk7258_rpmsgfs_test_neg_errno();
          goto out;
        }

      result->iterations_completed++;
    }

  result->step = BK7258_RPMSGFS_TEST_STEP_RMDIR;
  if (rmdir(BK7258_RPMSGFS_TEST_DIR) < 0)
    {
      ret = bk7258_rpmsgfs_test_neg_errno();
      goto out;
    }

  result->step = BK7258_RPMSGFS_TEST_STEP_NONE;

out:
  if (fd >= 0)
    {
      (void)close(fd);
    }

  if (dir != NULL)
    {
      (void)closedir(dir);
    }

  if (ret < 0)
    {
      bk7258_rpmsgfs_test_cleanup();
    }

  return ret;
}

static void bk7258_rpmsgfs_test_send_immediate_error(
  const struct bk7258_rpmsgfs_test_wire_s *request, int status)
{
  struct bk7258_rpmsgfs_test_wire_s response;

  memset(&response, 0, sizeof(response));
  response.magic = BK7258_RPMSGFS_TEST_WIRE_MAGIC;
  response.version = BK7258_RPMSGFS_TEST_WIRE_VERSION;
  response.command = BK7258_RPMSGFS_TEST_COMMAND_REPORT;
  response.generation = request->generation;
  response.sequence = request->sequence;
  response.iterations = request->iterations;
  response.payload_size = request->payload_size;
  response.timeout_ms = request->timeout_ms;
  response.result.magic = BK7258_RPMSGFS_TEST_RESULT_MAGIC;
  response.result.version = BK7258_RPMSGFS_TEST_RESULT_VERSION;
  response.result.size = sizeof(response.result);
  response.result.generation = request->generation;
  response.result.sequence = request->sequence;
  response.result.iterations_requested = request->iterations;
  response.result.payload_size = request->payload_size;
  response.result.status = status;
  response.result.worker_cpu = up_cpu_index();
  (void)rpmsg_trysend(&g_bk7258_rpmsgfs_test.ept, &response,
                      offsetof(struct bk7258_rpmsgfs_test_wire_s, result) +
                      sizeof(response.result));
}

static FAR void *bk7258_rpmsgfs_test_worker(FAR void *arg)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = &g_bk7258_rpmsgfs_test;
  struct bk7258_rpmsgfs_test_wire_s response;
  struct bk7258_rpmsgfs_test_result_s *result = &response.result;
  uint32_t generation;
  uint32_t sequence;
  int status;

  (void)arg;
  for (; ; )
    {
      if (nxsem_wait_uninterruptible(&priv->start_sem) < 0)
        {
          continue;
        }

      if (!__atomic_load_n(&priv->busy, __ATOMIC_ACQUIRE))
        {
          continue;
        }

      generation = priv->request_generation;
      sequence = priv->request_sequence;
      memset(&response, 0, sizeof(response));
      response.magic = BK7258_RPMSGFS_TEST_WIRE_MAGIC;
      response.version = BK7258_RPMSGFS_TEST_WIRE_VERSION;
      response.command = BK7258_RPMSGFS_TEST_COMMAND_REPORT;
      response.generation = generation;
      response.sequence = sequence;
      response.iterations = priv->request_iterations;
      response.payload_size = priv->request_payload_size;
      response.timeout_ms = priv->request_timeout_ms;

      result->magic = BK7258_RPMSGFS_TEST_RESULT_MAGIC;
      result->version = BK7258_RPMSGFS_TEST_RESULT_VERSION;
      result->size = sizeof(*result);
      result->generation = generation;
      result->sequence = sequence;
      result->iterations_requested = priv->request_iterations;
      result->payload_size = priv->request_payload_size;
      result->worker_cpu = up_cpu_index();
      result->status = -EINPROGRESS;

      bk7258_rpmsgfs_test_heap(&result->heap_before_used,
                               &result->heap_before_free,
                               &result->heap_before_largest);

      status = priv->request_status;
      if (status >= 0 && result->worker_cpu != 0)
        {
          result->step = BK7258_RPMSGFS_TEST_STEP_GENERATION;
          status = -EXDEV;
        }

      if (status >= 0 && !bk7258_rpmsgfs_test_generation_ready(generation))
        {
          result->step = BK7258_RPMSGFS_TEST_STEP_GENERATION;
          status = -ENOTCONN;
        }

      if (status >= 0)
        {
          status = bk7258_rpmsgfs_test_files(result);
        }

      result->status = status;
      bk7258_rpmsgfs_test_heap(&result->heap_after_used,
                               &result->heap_after_free,
                               &result->heap_after_largest);
      __asm volatile ("dmb sy" ::: "memory");

      if (bk7258_rpmsgfs_test_send_bounded(
            &response, offsetof(struct bk7258_rpmsgfs_test_wire_s, result) +
                       sizeof(response.result), generation,
            BK7258_RPMSGFS_TEST_SEND_TIMEOUT) < 0)
        {
          result->step = BK7258_RPMSGFS_TEST_STEP_REPORT;
        }

      __atomic_store_n(&priv->busy, false, __ATOMIC_RELEASE);
    }

  return NULL;
}

static int bk7258_rpmsgfs_test_spawn_worker(void)
{
  pthread_attr_t attr;
  struct sched_param param;
  cpu_set_t cpuset = (cpu_set_t)1u;
  pthread_t thread;
  int initialized = 0;
  int ret;

  ret = pthread_attr_init(&attr);
  if (ret == 0)
    {
      initialized = 1;
      ret = pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setstacksize(&attr,
                                      CONFIG_BK7258_RPMSGFS_TEST_STACKSIZE);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setaffinity_np(&attr, sizeof(cpuset), &cpuset);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setinheritsched(&attr, PTHREAD_EXPLICIT_SCHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setschedpolicy(&attr, SCHED_FIFO);
    }

  if (ret == 0)
    {
      memset(&param, 0, sizeof(param));
      param.sched_priority = CONFIG_BK7258_RPMSGFS_TEST_PRIORITY;
      ret = pthread_attr_setschedparam(&attr, &param);
    }

  if (ret == 0)
    {
      ret = pthread_create(&thread, &attr, bk7258_rpmsgfs_test_worker, NULL);
    }

  if (initialized)
    {
      (void)pthread_attr_destroy(&attr);
    }

