open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsgfs_test.c
  return ret == 0 ? OK : -ret;
}

#endif /* CONFIG_BK7258_AP_CORE */

static int bk7258_rpmsgfs_test_ept_cb(FAR struct rpmsg_endpoint *ept,
                                       FAR void *data, size_t len,
                                       uint32_t src, FAR void *priv_)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = priv_;
  struct bk7258_rpmsgfs_test_wire_s *msg = data;

  (void)ept;
  (void)src;
  if (msg == NULL ||
      len < offsetof(struct bk7258_rpmsgfs_test_wire_s, result) ||
      msg->magic != BK7258_RPMSGFS_TEST_WIRE_MAGIC ||
      msg->version != BK7258_RPMSGFS_TEST_WIRE_VERSION)
    {
      return -EINVAL;
    }

#ifdef CONFIG_BK7258_AP_CORE
  if (msg->command == BK7258_RPMSGFS_TEST_COMMAND_START)
    {
      bool expected = false;
      int request_status = OK;

      if (!__atomic_compare_exchange_n(&priv->busy, &expected, true, false,
                                       __ATOMIC_ACQ_REL, __ATOMIC_ACQUIRE))
        {
          bk7258_rpmsgfs_test_send_immediate_error(msg, -EBUSY);
          return OK;
        }

      if (msg->iterations == 0 ||
          msg->iterations > BK7258_RPMSGFS_TEST_MAX_ITERATIONS ||
          msg->payload_size == 0 ||
          msg->payload_size > BK7258_RPMSGFS_TEST_MAX_PAYLOAD ||
          msg->timeout_ms < BK7258_RPMSGFS_TEST_MIN_TIMEOUT ||
          msg->timeout_ms > BK7258_RPMSGFS_TEST_MAX_TIMEOUT)
        {
          request_status = -EINVAL;
        }
      else if (!bk7258_rpmsgfs_test_generation_ready(msg->generation))
        {
          request_status = -ENOTCONN;
        }

      priv->request_generation = msg->generation;
      priv->request_sequence = msg->sequence;
      priv->request_iterations = msg->iterations;
      priv->request_payload_size = msg->payload_size;
      priv->request_timeout_ms = msg->timeout_ms;
      priv->request_status = request_status;
      __asm volatile ("dmb sy" ::: "memory");
      (void)nxsem_post(&priv->start_sem);
      return OK;
    }
#else
  if (msg->command == BK7258_RPMSGFS_TEST_COMMAND_REPORT &&
      len == offsetof(struct bk7258_rpmsgfs_test_wire_s, result) +
             sizeof(msg->result) &&
      msg->generation == priv->waiting_generation &&
      msg->sequence == priv->waiting_sequence)
    {
      memcpy(&priv->report, &msg->result, sizeof(priv->report));
      __asm volatile ("dmb sy" ::: "memory");
      priv->report_valid = true;
      (void)nxsem_post(&priv->report_sem);
      return OK;
    }
#endif

  return -ENOMSG;
}

static void bk7258_rpmsgfs_test_device_created(
  FAR struct rpmsg_device *rdev, FAR void *priv_)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL ||
      strcmp(cpuname, BK7258_RPMSGFS_TEST_REMOTE_NAME) != 0)
    {
      return;
    }

#ifdef CONFIG_BK7258_AP_CORE
  priv->ept.priv = priv;
  priv->abort = false;
  priv->connection_error = rpmsg_create_ept(
    &priv->ept, rdev, BK7258_RPMSGFS_TEST_EPT_NAME,
    RPMSG_ADDR_ANY, RPMSG_ADDR_ANY, bk7258_rpmsgfs_test_ept_cb, NULL);
  if (priv->connection_error >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
#else
  priv->connection_error = OK;
#endif
}

#ifndef CONFIG_BK7258_AP_CORE
static bool bk7258_rpmsgfs_test_ns_match(FAR struct rpmsg_device *rdev,
                                         FAR void *priv_,
                                         FAR const char *name,
                                         uint32_t dest)
{
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  (void)priv_;
  (void)dest;
  return cpuname != NULL &&
         strcmp(cpuname, BK7258_RPMSGFS_TEST_REMOTE_NAME) == 0 &&
         strcmp(name, BK7258_RPMSGFS_TEST_EPT_NAME) == 0;
}

static void bk7258_rpmsgfs_test_ns_bind(FAR struct rpmsg_device *rdev,
                                        FAR void *priv_,
                                        FAR const char *name,
                                        uint32_t dest)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = priv_;

  priv->ept.priv = priv;
  priv->connection_error = rpmsg_create_ept(
    &priv->ept, rdev, name, RPMSG_ADDR_ANY, dest,
    bk7258_rpmsgfs_test_ept_cb, NULL);
  if (priv->connection_error >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
}
#endif

static void bk7258_rpmsgfs_test_device_destroy(
  FAR struct rpmsg_device *rdev, FAR void *priv_)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL ||
      strcmp(cpuname, BK7258_RPMSGFS_TEST_REMOTE_NAME) != 0)
    {
      return;
    }

  __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
  priv->connection_error = -ENOTCONN;
#ifdef CONFIG_BK7258_AP_CORE
  __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
  (void)nxsem_post(&priv->start_sem);
#else
  priv->report_valid = false;
  (void)nxsem_post(&priv->report_sem);
#endif

  if (priv->ept.rdev != NULL)
    {
      rpmsg_destroy_ept(&priv->ept);
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_rpmsgfs_test_initialize(void)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = &g_bk7258_rpmsgfs_test;
  int ret;

  if (priv->initialized)
    {
      return OK;
    }

  memset(priv, 0, sizeof(*priv));
  priv->connection_error = -ENOTCONN;
#ifdef CONFIG_BK7258_AP_CORE
  ret = bk7258_rpmsgfs_test_sem_init(&priv->start_sem);
#else
  ret = bk7258_rpmsgfs_test_sem_init(&priv->report_sem);
#endif
  if (ret < 0)
    {
      return ret;
    }

  ret = rpmsg_register_callback(
    priv, bk7258_rpmsgfs_test_device_created,
    bk7258_rpmsgfs_test_device_destroy,
#ifdef CONFIG_BK7258_AP_CORE
    NULL, NULL);
#else
    bk7258_rpmsgfs_test_ns_match, bk7258_rpmsgfs_test_ns_bind);
#endif
  if (ret < 0)
    {
#ifdef CONFIG_BK7258_AP_CORE
      nxsem_destroy(&priv->start_sem);
#else
      nxsem_destroy(&priv->report_sem);
#endif
      return ret;
    }

#ifdef CONFIG_BK7258_AP_CORE
  ret = bk7258_rpmsgfs_test_spawn_worker();
  if (ret < 0)
    {
      rpmsg_unregister_callback(
        priv, bk7258_rpmsgfs_test_device_created,
        bk7258_rpmsgfs_test_device_destroy, NULL, NULL);
      nxsem_destroy(&priv->start_sem);
      return ret;
    }
#endif

  priv->initialized = true;
  return OK;
}

#ifndef CONFIG_BK7258_AP_CORE
int bk7258_rpmsgfs_test_run(
  uint32_t iterations, uint32_t payload_size, uint32_t timeout_ms,
  struct bk7258_rpmsgfs_test_result_s *result)
{
  struct bk7258_rpmsgfs_test_dev_s *priv = &g_bk7258_rpmsgfs_test;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  struct bk7258_rpmsgfs_test_wire_s request;
  clock_t connect_started;
  uint32_t waited = 0;
  uint32_t slice;
  int ret;

  if (result == NULL || iterations == 0 ||
      iterations > BK7258_RPMSGFS_TEST_MAX_ITERATIONS ||
      payload_size == 0 ||
      payload_size > BK7258_RPMSGFS_TEST_MAX_PAYLOAD ||
      timeout_ms < BK7258_RPMSGFS_TEST_MIN_TIMEOUT ||
      timeout_ms > BK7258_RPMSGFS_TEST_MAX_TIMEOUT)
    {
      return -EINVAL;
    }

  memset(result, 0, sizeof(*result));
  ret = nxmutex_lock(&g_bk7258_rpmsgfs_test_lock);
  if (ret < 0)
    {
      return ret;
    }

  connect_started = clock_systime_ticks();
  while (!bk7258_rpmsgfs_test_endpoint_ready() &&
         !bk7258_rpmsgfs_test_deadline_expired(
           connect_started, BK7258_RPMSGFS_TEST_CONNECT_MS))
    {
      nxsig_usleep(1000);
    }

  if (!bk7258_rpmsgfs_test_endpoint_ready())
    {
      ret = priv->connection_error < 0 ?
            priv->connection_error : -ENOTCONN;
      goto out;
    }

  bk7258_rpmsgfs_test_flush_sem(&priv->report_sem);
  if (++g_bk7258_rpmsgfs_test_next_sequence == 0)
    {
      g_bk7258_rpmsgfs_test_next_sequence++;
    }

  priv->waiting_generation = control->generation;
  priv->waiting_sequence = g_bk7258_rpmsgfs_test_next_sequence;
  priv->report_valid = false;
  priv->connection_error = OK;
  memset(&priv->report, 0, sizeof(priv->report));
  memset(&request, 0, offsetof(struct bk7258_rpmsgfs_test_wire_s, result));
  request.magic = BK7258_RPMSGFS_TEST_WIRE_MAGIC;
  request.version = BK7258_RPMSGFS_TEST_WIRE_VERSION;
  request.command = BK7258_RPMSGFS_TEST_COMMAND_START;
  request.generation = priv->waiting_generation;
  request.sequence = priv->waiting_sequence;
  request.iterations = iterations;
  request.payload_size = payload_size;
  request.timeout_ms = timeout_ms;

  ret = bk7258_rpmsgfs_test_send_bounded(
          &request, offsetof(struct bk7258_rpmsgfs_test_wire_s, result),
          priv->waiting_generation, BK7258_RPMSGFS_TEST_SEND_TIMEOUT);
  if (ret < 0)
    {
      goto out;
    }

  ret = -ETIMEDOUT;
  while (waited < timeout_ms)
    {
      slice = timeout_ms - waited;
      if (slice > 50u)
        {
          slice = 50u;
        }

      ret = nxsem_tickwait_uninterruptible(&priv->report_sem,
                                            MSEC2TICK(slice));
      if (ret >= 0)
        {
          break;
        }

      if (ret != -ETIMEDOUT)
        {
          goto out;
        }

      if (!bk7258_rpmsgfs_test_endpoint_ready() ||
          !bk7258_rpmsgfs_test_generation_ready(
            priv->waiting_generation))
        {
          ret = priv->connection_error < 0 ?
                priv->connection_error : -ENOTCONN;
          goto out;
        }

      waited += slice;
    }

  if (ret < 0)
    {
      goto out;
    }

  __asm volatile ("dmb sy" ::: "memory");
  if (!priv->report_valid)
    {
      ret = priv->connection_error < 0 ?
            priv->connection_error : -EPROTO;
      goto out;
    }

  memcpy(result, &priv->report, sizeof(*result));
  if (result->magic != BK7258_RPMSGFS_TEST_RESULT_MAGIC ||
      result->version != BK7258_RPMSGFS_TEST_RESULT_VERSION ||
      result->size != sizeof(*result) ||
      result->generation != priv->waiting_generation ||
      result->sequence != priv->waiting_sequence)
    {
      ret = -EPROTO;
      goto out;
    }

  ret = result->status;

out:
  nxmutex_unlock(&g_bk7258_rpmsgfs_test_lock);
  return ret;
}
#endif

#endif /* CONFIG_BK7258_RPMSGFS_TEST */
